Catalogs/упТипыСобытийМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТипыСобытийМониторинга</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыСобытийМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастотаОповещения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОстановки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Погрешность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Датчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДатчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыСравненияЗначенийДатчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеДатчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.упЗначенияДатчиков</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дельта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогрешностьВремя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыИзмененийЗначенийДатчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФиксироватьСобытиеВТочкеМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодИзменения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьПрохождениеТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦиклическиФиксироватьСобытиеМониторинга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксироватьОтветВодителяПоСобытию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаВопросаИОтветов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНастройкиВопросаИОтветовПоСобытиямМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастраиваемоеСобытиеAndroidКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнициирующиеМониторингДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДействия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыДействийСобытийМониторинга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтменяющиеМониторингДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДействия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыДействийСобытийМониторинга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксирующиеСобытиеДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДействия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыДействийСобытийМониторинга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упВидыСобытийМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыСобытийМониторинга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВъездВЗону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыездИзЗоны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеДатчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененияЗначенияДатчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеОтМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеAndroidКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпозданиеВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланируемоеОпозданиеВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадержкаВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвижениеБезРейса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеВнешнейСистемыМониторинга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыДействийСобытийМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыДействийСобытийМониторинга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГеографическоеПрибытиеВТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВодительПрибылВТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВодительНачалРаботыВТочке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВодительОтчиталсяПоВсемРаботамВТочке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВодительУбылИзТочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыездИзРадиусаТочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаВнеТочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозобновлениеДвиженияВнеТочки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упВидыПравилМобильныйКлиент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыПравилМобильныйКлиент</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПравилаВыполненияРейса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПравилаПрохожденияТочек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПравилаВыполненияЗадач</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упТипыСобытийМониторинга/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//     Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//              где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы, связанного с
//              реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	Для каждого текРек из Метаданные.Справочники.упТипыСобытийМониторинга.Реквизиты цикл
		Если НЕ текРек.Имя = "Комментарий" тогда
			БлокируемыеРеквизиты.Добавить(текРек.Имя);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции
	
#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
	
// Процедура производит первоначальное заполнение предопределенных элементов справочника.
//
// Параметры:
//  Параметры  - Структура - Параметры.
//
Процедура ПервоначальноеЗаполнение(Параметры = Неопределено) Экспорт
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ВходящийЗвонок.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.ВходящийЗвонок;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ИсходящийЗвонок.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.ИсходящийЗвонок;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.НачалоРаботВТочкеМаршрута.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.НачалоРаботВТочкеМаршрута;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ПрибытиеВТочкуМаршрута.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.ПрибытиеВТочкуМаршрута;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.СообщениеДиспетчеру.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.СообщениеДиспетчеру;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.СообщениеОтДиспетчера.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.СообщениеОтДиспетчера;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.УбытиеСТочкиМаршрута.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.УбытиеСТочкиМаршрута;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ТочкаПропущена.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.ТочкаПропущена;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ОпозданиеВТочкеМаршрута.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.ОпозданиеВТочкеМаршрута;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ПланируемоеОпозданиеВТочкеМаршрута.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.ПланируемоеОпозданиеВТочкеМаршрута;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ЗадержкаВТочкеМаршрута.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.ЗадержкаВТочкеМаршрута;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ИзменениеСледующейТочкиПоМаршруту.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.ИзменениеСледующейТочкиПоМаршруту;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ОтсутствиеЛицензииНаПодключение.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.ОтсутствиеЛицензииНаПодключение;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ЗапросНаОптимизациюМаршрута.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.СобытиеМониторинга;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ЗапросНаДосрочноеУбытиеИзТочкиМаршрута.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.СобытиеМониторинга;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ЗапросНаДосрочноеЗавершениеРейса.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.СобытиеМониторинга;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ЗапросНаНазначениеТочкиСледующейПоМаршруту.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.СобытиеМониторинга;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ЗапросОтчетаПоЗадолженностямВодителя.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.СобытиеМониторинга;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ЗаправкаТоплива.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеВнешнейСистемыМониторинга;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.СобытиеМониторинга;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.СливТоплива.ПолучитьОбъект();
	текЭлемент.Активно            = Истина;
	текЭлемент.ВидСобытия         = Перечисления.упВидыСобытийМониторинга.СобытиеВнешнейСистемыМониторинга;
	текЭлемент.СтильМаркера       = Справочники.упСтилиМаркеров.СобытиеМониторинга;
	текЭлемент.Записать();
	
	#Область НастраиваемыеСобытияAndroidКлиента	
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ПревышениеВремениОжиданияНачалаРаботВТочкеМаршрута.ПолучитьОбъект();
	текЭлемент.Активно                            = Истина;
	текЭлемент.НастраиваемоеСобытиеAndroidКлиента = Истина;
	текЭлемент.ВидСобытия                         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.СобытиеМониторинга;
	текЭлемент.ТаймаутОтсрочки                    = 900;
	текЭлемент.ИнициирующиеМониторингДействия.Очистить();
	текЭлемент.ОтменяющиеМониторингДействия.Очистить();
	текЭлемент.ФиксирующиеСобытиеДействия.Очистить();
	НоваяСтрока = текЭлемент.ИнициирующиеМониторингДействия.Добавить();
	НоваяСтрока.ТипДействия = Перечисления.упТипыДействийСобытийМониторинга.ВодительПрибылВТочку;
	НоваяСтрока = текЭлемент.ОтменяющиеМониторингДействия.Добавить();
	НоваяСтрока.ТипДействия = Перечисления.упТипыДействийСобытийМониторинга.ВодительНачалРаботыВТочке;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ПроверкаПрибытияВТочкуМаршрута.ПолучитьОбъект();
	текЭлемент.Активно                            = Истина;
	текЭлемент.НастраиваемоеСобытиеAndroidКлиента = Истина;
	текЭлемент.ВидСобытия                         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.СобытиеМониторинга;
	текЭлемент.ТаймаутОтсрочки                    = 60;
	текЭлемент.ИнициирующиеМониторингДействия.Очистить();
	текЭлемент.ОтменяющиеМониторингДействия.Очистить();
	текЭлемент.ФиксирующиеСобытиеДействия.Очистить();
	НоваяСтрока = текЭлемент.ИнициирующиеМониторингДействия.Добавить();
	НоваяСтрока.ТипДействия = Перечисления.упТипыДействийСобытийМониторинга.ГеографическоеПрибытиеВТочку;
	НоваяСтрока = текЭлемент.ОтменяющиеМониторингДействия.Добавить();
	НоваяСтрока.ТипДействия = Перечисления.упТипыДействийСобытийМониторинга.ВодительПрибылВТочку;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ПроверкаУбытияСТочкиМаршрута.ПолучитьОбъект();
	текЭлемент.Активно                            = Истина;
	текЭлемент.НастраиваемоеСобытиеAndroidКлиента = Истина;
	текЭлемент.ВидСобытия                         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.СобытиеМониторинга;
	текЭлемент.ТаймаутОтсрочки                    = 60;
	текЭлемент.ИнициирующиеМониторингДействия.Очистить();
	текЭлемент.ОтменяющиеМониторингДействия.Очистить();
	текЭлемент.ФиксирующиеСобытиеДействия.Очистить();	
	НоваяСтрока = текЭлемент.ИнициирующиеМониторингДействия.Добавить();
	НоваяСтрока.ТипДействия = Перечисления.упТипыДействийСобытийМониторинга.ВодительОтчиталсяПоВсемРаботамВТочке;
	НоваяСтрока = текЭлемент.ОтменяющиеМониторингДействия.Добавить();
	НоваяСтрока.ТипДействия = Перечисления.упТипыДействийСобытийМониторинга.ВодительУбылИзТочки;
	НоваяСтрока = текЭлемент.ФиксирующиеСобытиеДействия.Добавить();
	НоваяСтрока.ТипДействия = Перечисления.упТипыДействийСобытийМониторинга.ВыездИзРадиусаТочки;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.НепредусмотреннаяОстановка.ПолучитьОбъект();
	текЭлемент.Активно                            = Истина;
	текЭлемент.НастраиваемоеСобытиеAndroidКлиента = Истина;
	текЭлемент.ВидСобытия                         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.СобытиеМониторинга;
	текЭлемент.ТаймаутОтсрочки                    = 600;
	текЭлемент.ИнициирующиеМониторингДействия.Очистить();
	текЭлемент.ОтменяющиеМониторингДействия.Очистить();
	текЭлемент.ФиксирующиеСобытиеДействия.Очистить();
	НоваяСтрока = текЭлемент.ИнициирующиеМониторингДействия.Добавить();
	НоваяСтрока.ТипДействия = Перечисления.упТипыДействийСобытийМониторинга.ОстановкаВнеТочки;
	НоваяСтрока = текЭлемент.ОтменяющиеМониторингДействия.Добавить();
	НоваяСтрока.ТипДействия = Перечисления.упТипыДействийСобытийМониторинга.ВодительПрибылВТочку;
	НоваяСтрока = текЭлемент.ОтменяющиеМониторингДействия.Добавить();
	НоваяСтрока.ТипДействия = Перечисления.упТипыДействийСобытийМониторинга.ВозобновлениеДвиженияВнеТочки;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упТипыСобытийМониторинга.ПревышениеВремениВыполненияРаботВТочкеМаршрута.ПолучитьОбъект();
	текЭлемент.Активно                            = Истина;
	текЭлемент.НастраиваемоеСобытиеAndroidКлиента = Истина;
	текЭлемент.ВидСобытия                         = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента;
	текЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.СобытиеМониторинга;
	текЭлемент.ТаймаутОтсрочки                    = 600;
	текЭлемент.ИнициирующиеМониторингДействия.Очистить();
	текЭлемент.ОтменяющиеМониторингДействия.Очистить();
	текЭлемент.ФиксирующиеСобытиеДействия.Очистить();	
	НоваяСтрока = текЭлемент.ИнициирующиеМониторингДействия.Добавить();
	НоваяСтрока.ТипДействия = Перечисления.упТипыДействийСобытийМониторинга.ВодительНачалРаботыВТочке;
	НоваяСтрока = текЭлемент.ОтменяющиеМониторингДействия.Добавить();
	НоваяСтрока.ТипДействия = Перечисления.упТипыДействийСобытийМониторинга.ВодительУбылИзТочки;
	текЭлемент.Записать();
	
	#КонецОбласти 
		
КонецПроцедуры // ПервоначальноеЗаполнение()
		
#КонецОбласти
	
#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ВидПравила = Неопределено;
	Если Параметры.Отбор.Свойство("ВидПравила", ВидПравила) Тогда 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьДанныеВыбораПоВидуПравил(ВидПравила);
	КонецЕсли;	
		
КонецПроцедуры

// Функция подготавливает доступные типы событий мониторинга по виду правила
//
Функция ПолучитьДанныеВыбораПоВидуПравил(ВидПравила) Экспорт
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Если ВидПравила = ПредопределенноеЗначение("Перечисление.упВидыПравилМобильныйКлиент.ПравилаВыполненияРейса")  Тогда
		ДанныеВыбора.Добавить(Справочники.упТипыСобытийМониторинга.НепредусмотреннаяОстановка);	
		
	ИначеЕсли ВидПравила = ПредопределенноеЗначение("Перечисление.упВидыПравилМобильныйКлиент.ПравилаПрохожденияТочек") Тогда
		ДанныеВыбора.Добавить(Справочники.упТипыСобытийМониторинга.ПревышениеВремениОжиданияНачалаРаботВТочкеМаршрута);
		ДанныеВыбора.Добавить(Справочники.упТипыСобытийМониторинга.ПроверкаПрибытияВТочкуМаршрута);
		ДанныеВыбора.Добавить(Справочники.упТипыСобытийМониторинга.ПроверкаУбытияСТочкиМаршрута);
		ДанныеВыбора.Добавить(Справочники.упТипыСобытийМониторинга.ПревышениеВремениВыполненияРаботВТочкеМаршрута);
	КонецЕсли;
	
	СписокИсключений = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	упТипыСобытийМониторинга.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.упТипыСобытийМониторинга КАК упТипыСобытийМониторинга
	|ГДЕ
	|	упТипыСобытийМониторинга.НастраиваемоеСобытиеAndroidКлиента
	|	И НЕ упТипыСобытийМониторинга.Предопределенный
	|	И НЕ упТипыСобытийМониторинга.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

#КонецОбласти
